#+Title: My personal Nixos configuration with flakes
#+Author: Valentino Bocchetti
#+STARTUP: overview

* Table of contents :toc:
- [[#about][About]]
- [[#structure][Structure]]
- [[#quick-start][Quick start]]
- [[#todo-list][TODO-LIST]]
  - [[#add-an-option-to-btrfs-configuration-work-in-progress][Add an option to btrfs configuration (work-in-progress)]]

* About
The entire system configuration is written in Nix. It is composed of a host specific configuration ([[file:host/home/][home]] & [[file:host/laptop/][laptop]]) that includes stuff  specific for my different hosts; a [[file:common/][common]] directory containing shared config files between all my machines, and a [[file:cachix/][cachix]] directory in order to make less expensive switching to a new generation ([[https://app.cachix.org/cache/nix-community][Installation guide]]).

A convenience [[file:nix-install.sh][script]] is provided to setup the system on the live ISO.
* Structure
#+begin_src sh
exa -T  --group-directories-first ~/Nixos
#+end_src

#+RESULTS:
| /home/valentino/Nixos |                |                            |                            |
| ├──                   | cachix         |                            |                            |
| │                     | └──            | nix-community.nix          |                            |
| ├──                   | common         |                            |                            |
| │                     | ├──            | dmenu-patches              |                            |
| │                     | │              | ├──                        | borders                    |
| │                     | │              | ├──                        | case-insensitive           |
| │                     | │              | ├──                        | numbers                    |
| │                     | │              | └──                        | selezione                  |
| │                     | ├──            | bootloader.nix             |                            |
| │                     | ├──            | cachix.nix                 |                            |
| │                     | ├──            | default.nix                |                            |
| │                     | ├──            | environment.nix            |                            |
| │                     | ├──            | fonts.nix                  |                            |
| │                     | ├──            | locales.nix                |                            |
| │                     | ├──            | nix.nix                    |                            |
| │                     | ├──            | overrides.nix              |                            |
| │                     | ├──            | packages.nix               |                            |
| │                     | ├──            | programs.nix               |                            |
| │                     | ├──            | security.nix               |                            |
| │                     | ├──            | services.nix               |                            |
| │                     | ├──            | shared.nix                 |                            |
| │                     | ├──            | user.nix                   |                            |
| │                     | └──            | virtualisation.nix         |                            |
| ├──                   | host           |                            |                            |
| │                     | ├──            | home                       |                            |
| │                     | │              | ├──                        | default.nix                |
| │                     | │              | ├──                        | hardware-configuration.nix |
| │                     | │              | ├──                        | hardware.nix               |
| │                     | │              | ├──                        | networking.nix             |
| │                     | │              | ├──                        | overlays.nix               |
| │                     | │              | ├──                        | services-home.nix          |
| │                     | │              | └──                        | xorg.nix                   |
| │                     | └──            | laptop                     |                            |
| │                     | ├──            | default.nix                |                            |
| │                     | ├──            | hardware-configuration.nix |                            |
| │                     | ├──            | hardware.nix               |                            |
| │                     | ├──            | networking.nix             |                            |
| │                     | ├──            | overlays.nix               |                            |
| │                     | ├──            | services-laptop.nix        |                            |
| │                     | ├──            | wayland.nix                |                            |
| │                     | └──            | xorg.nix                   |                            |
| ├──                   | options        |                            |                            |
| │                     | └──            | default.nix                |                            |
| ├──                   | flake.lock     |                            |                            |
| ├──                   | flake.nix      |                            |                            |
| ├──                   | home.nix       |                            |                            |
| ├──                   | nix-install.sh |                            |                            |
| ├──                   | README.org     |                            |                            |
| └──                   | thinkpad.nix   |                            |                            |

* Quick start
1. Download the latest build of [[https://nixos.org/download.html][Nixos]].
2. Boot into the installer.
3. Start the installation script in order to get a working installation (=./nix-install.sh -s=) (*NB* currently supported only ext4 in this configuration)
4. Enable nix-flakes with ~nix-shell -p git nixFlakes~
5. Clone the repository: ~git clone https://github.com/luftmensch-luftmensch/Nixos~  to =/mnt/etc/nixos=
6. Install NixOS: =nixos-install --root /mnt --flake /mnt/etc/nixos#XYZ=, where /XYZ is [the host you want to install]/
7. Reboot!
8. Change your ~root~ and ~$USER~ passwords!
9. Enjoy!
* TODO-LIST
** TODO Add an option to btrfs configuration (work-in-progress)
